## Major topic covered are Join, Combine, and Reshape.

## Hierarchical Indexing

In [3]:
## load Libraies 

import numpy as np
import pandas as pd

In [4]:
data = pd.Series(np.random.uniform(size=9),
                 index = [["a", "a", "a", "b", "b", "c", "c", "d", "d"],
                          [1, 2, 3, 1, 3, 1, 2, 2, 3]])
data

a  1    0.638882
   2    0.008294
   3    0.836631
b  1    0.695784
   3    0.706090
c  1    0.201649
   2    0.588532
d  2    0.810001
   3    0.803249
dtype: float64

In [5]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [8]:
data['b']

1    0.695784
3    0.706090
dtype: float64

In [9]:
data['b'][1]

0.6957843031196638

In [10]:
data["b":"c"]

b  1    0.695784
   3    0.706090
c  1    0.201649
   2    0.588532
dtype: float64

In [19]:
data.loc[["b","c"]]

b  1    0.695784
   3    0.706090
c  1    0.201649
   2    0.588532
dtype: float64

In [20]:
# Unstack

data.unstack()

          1         2         3
a  0.638882  0.008294  0.836631
b  0.695784       NaN  0.706090
c  0.201649  0.588532       NaN
d       NaN  0.810001  0.803249

In [21]:
data.unstack().stack()

a  1    0.638882
   2    0.008294
   3    0.836631
b  1    0.695784
   3    0.706090
c  1    0.201649
   2    0.588532
d  2    0.810001
   3    0.803249
dtype: float64

In [22]:
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),
 ....: index=[["a", "a", "b", "b"], [1, 2, 1, 2]],
 ....: columns=[["Ohio", "Ohio", "Colorado"],
 ....: ["Green", "Red", "Green"]])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [23]:
frame.index

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [25]:
frame.index.names = ["key1","key2"]

In [26]:
frame

           Ohio     Colorado
          Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [27]:
# check levels 

frame.index.levels

FrozenList([['a', 'b'], [1, 2]])

In [48]:
frame.columns.names = ["state", "color"]

### Reording and sorting levels

In [49]:
frame.swaplevel(0,1)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [50]:
frame.swaplevel("key1","key2")

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [51]:
frame.sort_index(level=1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [52]:
frame.swaplevel(0,1).sort_index(level=0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

### Summary statistics by level

In [53]:
frame.groupby(level="key2").sum()

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [54]:
frame.groupby(level="color", axis="columns").sum()

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

### Indexing with a DataFrame's columns

In [56]:
frame = pd.DataFrame({"a": range(7), "b": range(7, 0, -1),
 ....: "c": ["one", "one", "one", "two", "two", "two", "two"],
 ....: "d": [0, 1, 2, 0, 1, 2, 3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [57]:
# set index will create new DF with column as index
frame2 = frame.set_index(["c","d"]) 
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [58]:
frame.set_index(["c","d"], drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [60]:
frame2.reset_index() # opoosite of set index.

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

## Combining and Merging dataset

- pandas.merge
- pandas.concat
- combine_first

In [4]:
df1 = pd.DataFrame({"key": ["b", "b", "a", "c", "a", "a", "b"],
                    "data1": pd.Series(range(7), dtype="Int64")})
df2 = pd.DataFrame({"key": ["a", "b", "d"],
                    "data2": pd.Series(range(3), dtype="Int64")})

In [5]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [6]:
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [7]:
df1.merge(df2)

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [8]:
pd.merge(df1, df2)

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [9]:
pd.merge(df1, df2, on='key')

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [10]:
df3 = pd.DataFrame({"lkey": ["b", "b", "a", "c", "a", "a", "b"],
 ....: "data1": pd.Series(range(7), dtype="Int64")})
df4 = pd.DataFrame({"rkey": ["a", "b", "d"],
 ....: "data2": pd.Series(range(3), dtype="Int64")})

In [11]:
df3

  lkey  data1
0    b      0
1    b      1
2    a      2
3    c      3
4    a      4
5    a      5
6    b      6

In [13]:
df4

  rkey  data2
0    a      0
1    b      1
2    d      2

In [14]:
pd.merge(df3,df4, left_on="lkey", right_on='rkey') # Column name are different

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    b      6    b      1
3    a      2    a      0
4    a      4    a      0
5    a      5    a      0

In [15]:
pd.merge(df1, df2, how='outer')

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0
6   c      3   <NA>
7   d   <NA>      2

In [16]:
pd.merge(df3, df4, left_on='lkey', right_on='rkey', how = 'outer')

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    b      6    b      1
3    a      2    a      0
4    a      4    a      0
5    a      5    a      0
6    c      3  NaN   <NA>
7  NaN   <NA>    d      2

In [17]:
df1 = pd.DataFrame({"key": ["b", "b", "a", "c", "a", "b"],
 ....: "data1": pd.Series(range(6), dtype="Int64")})
df2 = pd.DataFrame({"key": ["a", "b", "a", "b", "d"],
 ....: "data2": pd.Series(range(5), dtype="Int64")})

In [18]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [19]:
df2

  key  data2
0   a      0
1   b      1
2   a      2
3   b      3
4   d      4

In [21]:
pd.merge(df1, df2, how='left', on='key') #cartesian product

   key  data1  data2
0    b      0      1
1    b      0      3
2    b      1      1
3    b      1      3
4    a      2      0
5    a      2      2
6    c      3   <NA>
7    a      4      0
8    a      4      2
9    b      5      1
10   b      5      3

In [22]:
pd.merge(df1, df2, how='inner')

  key  data1  data2
0   b      0      1
1   b      0      3
2   b      1      1
3   b      1      3
4   b      5      1
5   b      5      3
6   a      2      0
7   a      2      2
8   a      4      0
9   a      4      2

In [23]:
pd.merge(df1, df2, how='right')

   key  data1  data2
0    a      2      0
1    a      4      0
2    b      0      1
3    b      1      1
4    b      5      1
5    a      2      2
6    a      4      2
7    b      0      3
8    b      1      3
9    b      5      3
10   d   <NA>      4

In [24]:
left = pd.DataFrame({"key1": ["foo", "foo", "bar"],
 ....: "key2": ["one", "two", "one"],
 ....: "lval": pd.Series([1, 2, 3], dtype='Int64')})
right = pd.DataFrame({"key1": ["foo", "foo", "bar", "bar"],
 ....: "key2": ["one", "one", "one", "two"],
 ....: "rval": pd.Series([4, 5, 6, 7], dtype='Int64')})

In [25]:
left

  key1 key2  lval
0  foo  one     1
1  foo  two     2
2  bar  one     3

In [26]:
right

  key1 key2  rval
0  foo  one     4
1  foo  one     5
2  bar  one     6
3  bar  two     7

In [27]:
pd.merge(left, right)

  key1 key2  lval  rval
0  foo  one     1     4
1  foo  one     1     5
2  bar  one     3     6

In [29]:
pd.merge(left, right, on = ['key1', 'key2'], how = 'outer')

  key1 key2  lval  rval
0  foo  one     1     4
1  foo  one     1     5
2  foo  two     2  <NA>
3  bar  one     3     6
4  bar  two  <NA>     7

In [31]:
pd.merge(left, right, on="key2")

  key1_x key2  lval key1_y  rval
0    foo  one     1    foo     4
1    foo  one     1    foo     5
2    foo  one     1    bar     6
3    bar  one     3    foo     4
4    bar  one     3    foo     5
5    bar  one     3    bar     6
6    foo  two     2    bar     7

In [33]:
#suffixes option for specifying strings to append to overlapping names in the left and right DataFrame
pd.merge(left, right, on="key1", suffixes=("_left", "_right"))

  key1 key2_left  lval key2_right  rval
0  foo       one     1        one     4
1  foo       one     1        one     5
2  foo       two     2        one     4
3  foo       two     2        one     5
4  bar       one     3        one     6
5  bar       one     3        two     7

### Merging on Index

In [37]:
left = pd.DataFrame({'key':["a", "b", "a", "a", "b", "c"], 
                 'values': range(6)})
left

  key  values
0   a       0
1   b       1
2   a       2
3   a       3
4   b       4
5   c       5

In [38]:
right = pd.DataFrame({"group_val": [3.5, 7]}, index=["a", "b"])
right

   group_val
a        3.5
b        7.0

In [39]:
pd.merge(left, right, left_on='key', right_index=True) #indicate that the index should be used as the merge key

  key  values  group_val
0   a       0        3.5
2   a       2        3.5
3   a       3        3.5
1   b       1        7.0
4   b       4        7.0

In [41]:
pd.merge(left, right, left_on='key', right_index=True, how='outer')

  key  values  group_val
0   a       0        3.5
2   a       2        3.5
3   a       3        3.5
1   b       1        7.0
4   b       4        7.0
5   c       5        NaN

In [42]:
lefth = pd.DataFrame({"key1": ["Ohio", "Ohio", "Ohio",
 ....: "Nevada", "Nevada"],
 ....: "key2": [2000, 2001, 2002, 2001, 2002],
 ....: "data": pd.Series(range(5), dtype="Int64")})

In [43]:
righth_index = pd.MultiIndex.from_arrays( [
 ....: ["Nevada", "Nevada", "Ohio", "Ohio", "Ohio", "Ohio"],
 ....: [2001, 2000, 2000, 2000, 2001, 2002]
])

In [44]:
lefth

     key1  key2  data
0    Ohio  2000     0
1    Ohio  2001     1
2    Ohio  2002     2
3  Nevada  2001     3
4  Nevada  2002     4

In [46]:
righth_index

MultiIndex([('Nevada', 2001),
            ('Nevada', 2000),
            (  'Ohio', 2000),
            (  'Ohio', 2000),
            (  'Ohio', 2001),
            (  'Ohio', 2002)],
           )

In [49]:
righth = pd.DataFrame({"event1":pd.Series([0, 2, 4, 6, 8, 10], index=righth_index),
                       'event2':pd.Series([1, 3, 5, 7, 9, 11], index=righth_index)
                      })

In [50]:
righth

             event1  event2
Nevada 2001       0       1
       2000       2       3
Ohio   2000       4       5
       2000       6       7
       2001       8       9
       2002      10      11

In [54]:
pd.merge(lefth, righth, left_on=["key1", "key2"], right_index=True)

     key1  key2  data  event1  event2
0    Ohio  2000     0       4       5
0    Ohio  2000     0       6       7
1    Ohio  2001     1       8       9
2    Ohio  2002     2      10      11
3  Nevada  2001     3       0       1

In [55]:
pd.merge(lefth, righth, left_on=["key1", "key2"], right_index=True, how='outer')

     key1  key2  data  event1  event2
0    Ohio  2000     0     4.0     5.0
0    Ohio  2000     0     6.0     7.0
1    Ohio  2001     1     8.0     9.0
2    Ohio  2002     2    10.0    11.0
3  Nevada  2001     3     0.0     1.0
4  Nevada  2002     4     NaN     NaN
4  Nevada  2000  <NA>     2.0     3.0

In [ ]:
279